# Основы программирования на Python
# Wydano 27.01.2022
# Wykonać do: 17.02.2022
# Temat Практическая работа. Камень Ножницы Бумага
# Wykładowca Буйлук Андрей
# Lesson11
#
# Курс: Python Junior
#
# Задание 1
# Доработайте игру, которую мы делали на уроке.
# - Добавьте возможность после окончания игры поиграть
# в игру заново. После окончания игры пользователю
# предлагается сыграть еще раз, если он этого хочет –
# игра начинается заново, иначе заканчивается.
# - Если пользователь вводит что-то неправильно – его
# просят ввести свой выбор еще раз, пока он не будет
# правильным.
#
# Задание 2
# (Дополнительное, на высокую оценку)
# Есть другие варианты игры, которые содержат большее
# количество вариантов – «Камень, ножницы, бумага, ящерица,
# Спок». Переделайте игру по такому принципу.
