# Основы программирования на Python
# Wydano 20.01.2022
# Wykonać do: 11.02.2022
# Temat Циклы: while
# Wykładowca Буйлук Андрей
# Lesson08
#
# Курс:
# Python Junior
#
# Задание 1
# Доработайте игру «Guess my number»,
# добавив следующие функции.
# - Улучшите игру так, чтобы после угадывания числа,
# выводился номер попытки, которую сделал пользователь
# для угадывания магического числа.
# - Улучшите игру так, чтобы после угадывания числа,
# выводилось количество потраченных попыток, которые сделал
# пользователь для угадывания магического числа.
#
# Задание 2
# (Дополнительное, на высокую оценку)
# Добавить возможность играть в игру заново.
# После того как пользователь угадает число, отображается
# сообщение: «Вы хотите сыграть заново? ([Да] или [Нет])».
# Если пользователь отвечает [Да], игра начинается заново,
# если отвечает [Нет] – игра заканчивается.

