# Основы программирования на Python
# Wydano 25.01.2022
# Wykonać do: 15.02.2022
# Temat Цикл for
# Wykładowca Буйлук Андрей
# Lesson10
#
# Курс: «Введение в язык программирования Python
# Модуль 3. Циклы. Часть 3
#
# Задание 1
# Напишите программу, которая запрашивает два
# целых числа x и y, после чего вычисляет и выводит
# значение x в степени y.
#
# Задание 2
# Подсчитать количество целых чисел в диапазоне от
# 100 до 999 у которых есть две одинаковые цифры.
#
# Задание 3
# Подсчитать количество целых чисел в диапазоне от
# 100 до 9999 у которых все цифры разные.
#
# Задание 4
# Пользователь вводит любое целое число. Необхо-
# димо из этого целого числа удалить все цифры 3 и 6 и
# вывести обратно на экран.

# ------------------------------------------

