# Основы программирования на Python
# Wydano 15.02.2022
# Wykonać do: 8.03.2022
# Temat Файлы
# Wykładowca _________________
# Lesson21
#
#
# Курс: «Введение в язык программирования Python
# Модуль 5. Файлы.
# Тема: Файлы. Часть 1
#
# Задание 1
# Дано два текстовых файла. Выяснить, совпадают ли
# их строки. Если нет, то вывести несовпадающую строку
# из каждого файла.
#
# Задание 2
# Дан текстовый файл. Необходимо создать новый файл
# и записать в него следующую статистику по исходному
# файлу:
# - Количество символов;
# - Количество строк;
# - Количество гласных букв;
# - Количество согласных букв;
# - Количество цифр.
#
# Задание 3
# Дан текстовый файл. Удалить из него последнюю
# строку. Результат записать в другой файл.
#
# Задание 4
# Дан текстовый файл. Найти длину самой длинной
# строки.
#
# Задание 5
# Дан текстовый файл. Посчитать сколько раз в нем
# встречается заданное пользователем слово.
#
# Задание 6
# Дан текстовый файл. Найти и заменить в нем задан-
# ное слово. Что искать и на что заменять определяется
# пользователем.




# ---------------------------------------------
# Задание 1
# Дано два текстовых файла. Выяснить, совпадают ли
# их строки. Если нет, то вывести несовпадающую строку
# из каждого файла.






# ---------------------------------------------
# Задание 2
# Дан текстовый файл. Необходимо создать новый файл
# и записать в него следующую статистику по исходному
# файлу:
# - Количество символов;
# - Количество строк;
# - Количество гласных букв;
# - Количество согласных букв;
# - Количество цифр.






# ---------------------------------------------
# Задание 3
# Дан текстовый файл. Удалить из него последнюю
# строку. Результат записать в другой файл.






# ---------------------------------------------
# Задание 4
# Дан текстовый файл. Найти длину самой длинной
# строки.






# ---------------------------------------------
# Задание 5
# Дан текстовый файл. Посчитать сколько раз в нем
# встречается заданное пользователем слово.





# ---------------------------------------------
# Задание 6
# Дан текстовый файл. Найти и заменить в нем задан-
# ное слово. Что искать и на что заменять определяется
# пользователем.





# ---------------------------------------------
# ---------------------------------------------
